In [38]:
import pandas as pd
marks = pd.read_csv('https://media-doselect.s3.amazonaws.com/generic/GZVBQG5pzJeNaL1ve50Rv9YNV/class-grades.csv')
marks.head()

   Prefix  Assignment  Tutorial  Midterm  TakeHome  Final
0       5       57.14     34.09    64.38     51.48  52.50
1       8       95.05    105.49    67.50     99.07  68.33
2       8       83.70     83.17    30.00     63.15  48.89
3       7       81.22     96.06    49.38    105.93  80.56
4       8       91.32     93.64    95.00    107.41  73.89

In [12]:
#Count the number of missing values in each column of the dataset 'marks'.
marks.isna().sum()

Prefix         0
Assignment     2
Tutorial      12
Midterm       16
TakeHome       9
Final          5
dtype: int64

In [20]:
import numpy as np 
d = np.where(marks.isnull().sum(axis=1) == 5)
idx = marks.index[d]
idx
marks = marks.drop(idx)
marks.value_counts()

Prefix  Assignment  Tutorial  Midterm  TakeHome  Final
4       86.86       62.64     92.50    85.19     62.78     1
8       83.70       83.17     60.62    63.15     57.78     1
        87.93       108.97    28.75    87.96     47.78     1
                    106.53    37.50    97.41     28.06     1
        87.52       91.58     56.25    71.85     85.00     1
                                                          ..
7       95.00       92.58     93.12    97.78     68.06     1
        93.83       102.19    106.25   94.44     102.78    1
                    95.43     88.12    80.93     90.00     1
        92.01       112.58    86.25    86.11     83.33     1
8       97.33       106.74    76.88    108.89    83.89     1
Name: count, Length: 79, dtype: int64

In [39]:
#Remove all the rows in the dataset 'marks' having 5 missing values and then print the number of missing values in each column.
marks = marks[marks.isna().sum(axis=1) < 5]
print(marks.isna().sum())

Prefix         0
Assignment     0
Tutorial      10
Midterm       14
TakeHome       7
Final          3
dtype: int64

In [37]:
#Remove all the rows in the dataset 'marks' having 5 missing values and then print the number of missing values in each column.
marks = marks[marks.isna().sum(axis=1) != 5]
# marks_filtered = marks.dropna(thresh=5)
# print(marks_filtered.isna().sum())
print(marks.isna().sum())
# marks.isna().sum(axis=1)

Prefix         0
Assignment     0
Tutorial      10
Midterm       14
TakeHome       7
Final          3
dtype: int64

In [ ]:
marks.dropna(thresh=5) #this will remove all rows with 5 or more missing values

In [2]:
import pandas as pd
customer = pd.read_csv('https://media-doselect.s3.amazonaws.com/generic/9B2ZPE1apMvqrLWx7p8ge9dqX/cust_dimen.csv')

print(customer.head(10))

        Customer_Name Province   Region Customer_Segment  Cust_id
0  MUHAMMED MACINTYRE  NUNAVUT  NUNAVUT   SMALL BUSINESS   Cust_1
1        BARRY FRENCH  NUNAVUT  NUNAVUT         CONSUMER   Cust_2
2       CLAY ROZENDAL  NUNAVUT  NUNAVUT        CORPORATE   Cust_3
3      CARLOS SOLTERO  NUNAVUT  NUNAVUT         CONSUMER   Cust_4
4        CARL JACKSON  NUNAVUT  NUNAVUT        CORPORATE   Cust_5
5      MONICA FEDERLE  NUNAVUT  NUNAVUT        CORPORATE   Cust_6
6     DOROTHY BADDERS  NUNAVUT  NUNAVUT      HOME OFFICE   Cust_7
7     NEOLA SCHNEIDER  NUNAVUT  NUNAVUT      HOME OFFICE   Cust_8
8         CARLOS DALY  NUNAVUT  NUNAVUT      HOME OFFICE   Cust_9
9       CLAUDIA MINER  NUNAVUT  NUNAVUT   SMALL BUSINESS  Cust_10

In [6]:
customer["Cust_id"] = customer["Cust_id"].apply(lambda x: x.replace("Cust_", ""))
customer["Cust_id"]

0          1
1          2
2          3
3          4
4          5
        ...
1827    1828
1828    1829
1829    1830
1830    1831
1831    1832
Name: Cust_id, Length: 1832, dtype: object

In [8]:
import pandas as pd
rating = pd.read_csv('https://media-doselect.s3.amazonaws.com/generic/JPAqXRWexo7nybkQ7BjPLWVN/rating_final.csv')
rating.head()

# Remove duplicate rows based on all columns
rating_no_duplicates = rating.drop_duplicates()
rating_no_duplicates.head()

  userID  placeID  rating  food_rating  service_rating
0  U1077   135085       2            2               2
1  U1077   135038       2            2               1
2  U1077   132825       2            2               2
3  U1077   135060       1            2               2
4  U1068   135104       1            1               2